## Plan for terraform
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 16 to add, 1 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_acm_certificate.sre_bot will be created
  + resource "aws_acm_certificate" "sre_bot" {
      + arn                       = (known after apply)
      + domain_name               = "sre-bot.cdssandbox.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "*.sre-bot.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "sre-bot.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.sre-bot.cdssandbox.xyz",
        ]
      + tags                      = {
          + "CostCentre" = "sre-bot"
        }
      + tags_all                  = {
          + "CostCentre" = "sre-bot"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.sre_bot will be created
  + resource "aws_acm_certificate_validation" "sre_bot" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:ca-central-1:283582579564:service/sre-bot-cluster/sre-bot-service"
        name                               = "sre-bot-service"
        tags                               = {
            "CostCentre" = "sre-bot"
        }
        # (15 unchanged attributes hidden)



      + load_balancer {
          + container_name   = "sre-bot"
          + container_port   = 8000
          + target_group_arn = (known after apply)
        }

      ~ network_configuration {
          ~ security_groups  = [
              - "sg-05d66a956f3eb00b1",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }
        # (2 unchanged blocks hidden)
    }

  # aws_lb.sre_bot will be created
  + resource "aws_lb" "sre_bot" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "sre-bot"
      + security_groups            = (known after apply)
      + subnets                    = [
          + "subnet-0db02cc529cf31e4e",
        ]
      + tags                       = {
          + "CostCentre" = "sre-bot"
        }
      + tags_all                   = {
          + "CostCentre" = "sre-bot"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.sre_bot_listener will be created
  + resource "aws_lb_listener" "sre_bot_listener" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-FS-1-2-Res-2019-08"
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.sre_bot will be created
  + resource "aws_lb_target_group" "sre_bot" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "sre-bot"
      + port                               = 8000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "CostCentre" = "sre-bot"
        }
      + tags_all                           = {
          + "CostCentre" = "sre-bot"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0f32fae06795127ce"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 10
          + matcher             = (known after apply)
          + path                = "/version"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_route53_health_check.sre_bot_healthcheck will be created
  + resource "aws_route53_health_check" "sre_bot_healthcheck" {
      + arn               = (known after apply)
      + disabled          = false
      + enable_sni        = (known after apply)
      + failure_threshold = 3
      + fqdn              = "sre-bot.cdssandbox.xyz"
      + id                = (known after apply)
      + measure_latency   = false
      + port              = 443
      + request_interval  = 30
      + resource_path     = "/version"
      + tags              = {
          + "CostCentre" = "sre-bot"
        }
      + tags_all          = {
          + "CostCentre" = "sre-bot"
        }
      + type              = "HTTPS"
    }

  # aws_route53_record.sre_bot will be created
  + resource "aws_route53_record" "sre_bot" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "sre-bot.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.sre_bot_certificate_validation["*.sre-bot.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "sre_bot_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # aws_route53_record.sre_bot_certificate_validation["sre-bot.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "sre_bot_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # aws_route53_zone.sre_bot will be created
  + resource "aws_route53_zone" "sre_bot" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "sre-bot.cdssandbox.xyz"
      + name_servers  = (known after apply)
      + tags          = {
          + "CostCentre" = "sre-bot"
        }
      + tags_all      = {
          + "CostCentre" = "sre-bot"
        }
      + zone_id       = (known after apply)
    }

  # aws_security_group.ecs_tasks must be replaced
-/+ resource "aws_security_group" "ecs_tasks" {
      ~ arn                    = "arn:aws:ec2:ca-central-1:283582579564:security-group/sg-05d66a956f3eb00b1" -> (known after apply)
      ~ description            = "Only allow outbound traffic" -> "Allow inbound and outbout traffic for SRE Bot" # forces replacement
      ~ id                     = "sg-05d66a956f3eb00b1" -> (known after apply)
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = ""
              + from_port        = 8000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8000
            },
        ]
        name                   = "sre-bot-security-group"
      + name_prefix            = (known after apply)
      ~ owner_id               = "283582579564" -> (known after apply)
      ~ tags                   = {
          + "CostCentre" = "sre-bot"
        }
      ~ tags_all               = {
          + "CostCentre" = "sre-bot"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_security_group.sre_bot_load_balancer will be created
  + resource "aws_security_group" "sre_bot_load_balancer" {
      + arn                    = (known after apply)
      + description            = "Ingress - SRE Bot Load Balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = ""
              + from_port        = 8000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8000
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "SRE Bot load balancer"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "sre-bot"
        }
      + tags_all               = {
          + "CostCentre" = "sre-bot"
        }
      + vpc_id                 = "vpc-0f32fae06795127ce"
    }

  # module.vpc.aws_network_acl_rule.https_request_in_ingress_443[0] will be created
  + resource "aws_network_acl_rule" "https_request_in_ingress_443" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = "acl-0a967fedfac4a3059"
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 70
      + to_port        = 443
    }

  # module.vpc.aws_network_acl_rule.https_request_in_ingress_ephemeral[0] will be created
  + resource "aws_network_acl_rule" "https_request_in_ingress_ephemeral" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = false
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = "acl-0a967fedfac4a3059"
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 71
      + to_port        = 65535
    }

  # module.vpc.aws_network_acl_rule.https_request_in_response_egress_443[0] will be created
  + resource "aws_network_acl_rule" "https_request_in_response_egress_443" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = true
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = "acl-0a967fedfac4a3059"
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 72
      + to_port        = 443
    }

  # module.vpc.aws_network_acl_rule.https_request_in_response_egress_ephemeral[0] will be created
  + resource "aws_network_acl_rule" "https_request_in_response_egress_ephemeral" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = "acl-0a967fedfac4a3059"
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 73
      + to_port        = 65535
    }

Plan: 16 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sre-bot_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_dynamodb_table.webhooks_table"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.main"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.sre-bot_secrets_manager"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.sre_bot_listener"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_health_check.sre_bot_healthcheck"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.app_token"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.pickle_string"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.slack_token"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.sre_bot_load_balancer"]
WARN - plan.json - main - Missing Common Tags: ["module.attach_tf_plan_policy.aws_iam_policy.this"]

36 tests, 16 passed, 20 warnings, 0 failures, 0 exceptions

```

</details>
